In [1]:
import dapla as dp
import pandas as pd

In [6]:
# Se alle "mock"-datasettene i /felles/ p√• dapla
dp.show('/felles/mock')

                                              path               timestamp
0    /felles/mock_sysselsatte/companies_2019_10000 2021-02-23 09:44:16.678
1    /felles/mock_sysselsatte/companies_2019_30000 2021-03-03 07:05:35.853
2    /felles/mock_sysselsatte/companies_2020_10000 2021-02-26 16:00:24.381
3    /felles/mock_sysselsatte/companies_2020_30000 2021-03-03 11:00:33.237
4    /felles/mock_sysselsatte/companies_2021_10000 2021-02-26 16:01:25.697
5    /felles/mock_sysselsatte/companies_2021_30000 2021-03-03 11:05:14.427
6    /felles/mock_sysselsatte/companies_2022_10000 2021-02-26 16:02:25.987
7    /felles/mock_sysselsatte/companies_2022_30000 2021-03-03 11:10:23.890
8    /felles/mock_sysselsatte/companies_2023_10000 2021-02-26 16:03:14.080
9    /felles/mock_sysselsatte/companies_2023_30000 2021-03-03 11:14:50.105
10   /felles/mock_sysselsatte/companies_2024_30000 2021-03-03 09:56:22.390
11  /felles/mock_sysselsatte/population_2019_10000 2021-02-23 09:44:18.095
12  /felles/mock_sysselsatte/population_2019_30000 2021-03-03 07:05:37.135
13  /felles/mock_sysselsatte/population_2020_10000 2021-02-26 16:00:25.598
14  /felles/mock_sysselsatte/population_2020_30000 2021-03-03 11:00:35.487
15  /felles/mock_sysselsatte/population_2021_10000 2021-02-26 16:01:26.650
16  /felles/mock_sysselsatte/population_2021_30000 2021-03-03 11:05:15.945
17  /felles/mock_sysselsatte/population_2022_10000 2021-02-26 16:02:26.930
18  /felles/mock_sysselsatte/population_2022_30000 2021-03-03 11:10:24.872
19  /felles/mock_sysselsatte/population_2023_10000 2021-02-26 16:03:15.012
20  /felles/mock_sysselsatte/population_2023_30000 2021-03-03 11:14:50.821
21  /felles/mock_sysselsatte/population_2024_30000 2021-03-03 09:56:23.683

In [7]:
# Stapp datasettene som "objekter" inn i ett "variabelnavn"
comp = dp.read_pandas('/felles/mock_sysselsatte/companies_2019_30000')
pop = dp.read_pandas('/felles/mock_sysselsatte/population_2019_30000')

In [8]:
#Print preview av ett datasett
comp

        work_id    nace region_code                   region  employee_points
0     118415099  11.070          03                     Oslo               60
1     165189001  10.920          03                     Oslo               54
2     205912967  10.130          02         Akershus (-2019)               48
3     959013544  46.693          12        Hordaland (-2019)               46
4     405013223  09.900          02         Akershus (-2019)               88
...         ...     ...         ...                      ...              ...
1128  706734220  51.210          50  Tr√∏ndelag - Tr√∂√∂ndelage               15
1129  156404021  74.200          18                 Nordland               23
1130  962214437  74.102          18                 Nordland               12
1131  999083400  43.341          10       Vest-Agder (-2019)               21
1132  438579667  27.900          07         Vestfold (-2019)               16

[1133 rows x 5 columns]

In [9]:
# Og det andre
pop

                id work_id      sex  age  year_birth  work_percent
0      29101946112    None     Menn    0        2019           NaN
1      26101930288    None     Menn    0        2019           NaN
2      22091952214    None     Menn    0        2019           NaN
3      04071997222    None     Menn    0        2019           NaN
4      07101970642    None     Menn    0        2019           NaN
...            ...     ...      ...  ...         ...           ...
29995  15072660901    None  Kvinner   93        1926           NaN
29996  23012604128    None  Kvinner   93        1926           NaN
29997  14102931680    None  Kvinner   90        1929           NaN
29998  29062932768    None  Kvinner   90        1929           NaN
29999  11072931487    None  Kvinner   90        1929           NaN

[30000 rows x 6 columns]